Revit 2026 API

# UIMacroManagerRemoveModule Method

---

Removes a MacroModule.

**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveModule(
	MacroModule module
)
```
```vb
Public Sub RemoveModule (
	module As MacroModule
)
```
```cpp
public:
void RemoveModule(
	MacroModule^ module
)
```
```fsharp
member RemoveModule :
        module : MacroModule -> unit
```

#### Parameters

module MacroModule
     The module will be removed.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UIMacroManager Class

Autodesk.Revit.UI.Macros Namespace